IDEA StatiCa Open Model
TendonDuct.MaterialDuct Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon duct material
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public MaterialDuct MaterialDuct { get; set; }
Public Property MaterialDuct As MaterialDuct
	Get
	Set
public:
property MaterialDuct MaterialDuct {
	MaterialDuct get ();
	void set (MaterialDuct value);
}
Property Value
Type: MaterialDuct
See Also
Reference
TendonDuct Class
IdeaRS.OpenModel.CrossSection Namespace